<!-- dflook/terraform-github-actions {"workspace":"default","backend":"eb3cf4021b9d286d0b80e0710d715dc76b3e9b1fa221e5fa337fcb92c970f683","backend_type":"s3","plan_job_ref":"Job plan #205 at https://github.com/18F/tts-tech-portfolio/actions/runs/3115641182","plan_hash":"707715450d0ca0ea5b6ec12f6015815e934c4f9c5e9b2a6b42f75b096025dfdc","plan_text_format":"text"} -->
Terraform plan in __terraform__
<details>
<summary>Plan: 27 to add, 6 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cloud_gov.github_membership.owner["lrussell01"] will be created
  + resource "github_membership" "owner" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "lrussell01"
    }

  # module.digital_analytics_program.github_membership.owner["lrussell01"] will be created
  + resource "github_membership" "owner" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "lrussell01"
    }

  # module.digitalgov.github_membership.owner["lrussell01"] will be created
  + resource "github_membership" "owner" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "lrussell01"
    }

  # module.federalist_users.github_membership.owner["lrussell01"] will be created
  + resource "github_membership" "owner" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "lrussell01"
    }

  # module.fedramp.github_membership.owner["lrussell01"] will be created
  + resource "github_membership" "owner" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "lrussell01"
    }

  # module.fellows_in_innovation.github_membership.owner["lrussell01"] will be created
  + resource "github_membership" "owner" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "lrussell01"
    }

  # module.org_18f.github_membership.owner["lrussell01"] will be created
  + resource "github_membership" "owner" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "lrussell01"
    }

  # module.presidential_innovation_fellows.github_membership.owner["lrussell01"] will be created
  + resource "github_membership" "owner" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "lrussell01"
    }

  # module.project_open_data.github_membership.owner["lrussell01"] will be created
  + resource "github_membership" "owner" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "lrussell01"
    }

  # module.repo["aws-admin"].github_repository_file.issue_templates["general.md"] will be updated in-place
  ~ resource "github_repository_file" "issue_templates" {
      ~ content             = <<-EOT
            ---
            name: General
            about: For general Tech Portfolio work
            title: ""
            labels: "g: initial"
            assignees: ""
            ---
            
            ## Background Information
            
            <!-- Description, links, [user stories](https://www.agilealliance.org/glossary/user-stories/), etc. What is the problem we are trying to solve? If the work is described/tracked elsewhere, feel free to simply link there. Use the [INVEST](https://www.agilealliance.org/glossary/invest) method to assess completeness. -->
            
            ## Implementation Steps
            
            <!-- This is the "how": the steps to get the acceptance criteria fulfilled. They can be filled in and adjusted after the issue is created/groomed. -->
            
            - [ ]
            
            ## Acceptance Criteria
            
          - <!-- Definition of Done. ](https://www.agilealliance.org/glossary/definition-of-done) Should be as objective as possible. -->
          + <!-- [Definition of Done](https://www.agilealliance.org/glossary/definition-of-done). This should be as objective as possible. -->
            
            - [ ]
        EOT
        id                  = "aws-admin/.github/ISSUE_TEMPLATE/general.md"
        # (9 unchanged attributes hidden)
    }

  # module.repo["charlie"].github_issue_label.labels["g: accepted"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "662e9b"
      + description = "Issue has been fully groomed."
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "g: accepted"
      + repository  = "charlie"
      + url         = (known after apply)
    }

  # module.repo["charlie"].github_issue_label.labels["g: final"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "662e9b"
      + description = "Issue ready for review."
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "g: final"
      + repository  = "charlie"
      + url         = (known after apply)
    }

  # module.repo["charlie"].github_issue_label.labels["g: initial"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "662e9b"
      + description = "Issue template needs to be filled out, and/or initiative/timing labels need to be added."
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "g: initial"
      + repository  = "charlie"
      + url         = (known after apply)
    }

  # module.repo["charlie"].github_issue_label.labels["i: SaaS"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "6ecbdb"
      + description = "Relating to third-party software: acquisition, security compliance, etc."
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "i: SaaS"
      + repository  = "charlie"
      + url         = (known after apply)
    }

  # module.repo["charlie"].github_issue_label.labels["i: custom software"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "6ecbdb"
      + description = "Relating to systems built in TTS and their need for tools, guidance, security authorization, etc."
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "i: custom software"
      + repository  = "charlie"
      + url         = (known after apply)
    }

  # module.repo["charlie"].github_issue_label.labels["i: customer support"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "6ecbdb"
      + description = "Relating to supporting TTS staff and partners: troubleshooting, documentation, etc."
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "i: customer support"
      + repository  = "charlie"
      + url         = (known after apply)
    }

  # module.repo["charlie"].github_issue_label.labels["i: infrastructure"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "6ecbdb"
      + description = "Relating to technology underneath/supporting custom software across TTS"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "i: infrastructure"
      + repository  = "charlie"
      + url         = (known after apply)
    }

  # module.repo["charlie"].github_issue_label.labels["i: internal team"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "6ecbdb"
      + description = "Relating to process or training within the Tech Portfolio, or communication about the team outwards"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "i: internal team"
      + repository  = "charlie"
      + url         = (known after apply)
    }

  # module.repo["charlie"].github_issue_label.labels["i: misc"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "6ecbdb"
      + description = "Issues that don't fit in another Initiative"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "i: misc"
      + repository  = "charlie"
      + url         = (known after apply)
    }

  # module.repo["charlie"].github_issue_label.labels["m: due date"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "ea3546"
      + description = "Has a hard or soft deadline"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "m: due date"
      + repository  = "charlie"
      + url         = (known after apply)
    }

  # module.repo["charlie"].github_issue_label.labels["t: days"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "f86624"
      + description = "Should be complete-able in a matter of days or less (wall clock time)"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "t: days"
      + repository  = "charlie"
      + url         = (known after apply)
    }

  # module.repo["charlie"].github_issue_label.labels["t: expedite"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "f86624"
      + description = "Needed to be pulled into a sprint after Planning was complete"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "t: expedite"
      + repository  = "charlie"
      + url         = (known after apply)
    }

  # module.repo["charlie"].github_issue_label.labels["t: months"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "f86624"
      + description = "Should be complete-able in a matter of months (wall clock time) — should be split up"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "t: months"
      + repository  = "charlie"
      + url         = (known after apply)
    }

  # module.repo["charlie"].github_issue_label.labels["t: weeks"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "f86624"
      + description = "Should be complete-able in a matter of weeks (wall clock time) — see what can be split out"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "t: weeks"
      + repository  = "charlie"
      + url         = (known after apply)
    }

  # module.repo["charlie"].github_repository_file.issue_templates["general.md"] will be created
  + resource "github_repository_file" "issue_templates" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = <<-EOT
            updated from canonical source
            
            https://github.com/18F/tts-tech-portfolio/blob/main/.github/ISSUE_TEMPLATE/general.md
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ---
            name: General
            about: For general Tech Portfolio work
            title: ""
            labels: "g: initial"
            assignees: ""
            ---
            
            ## Background Information
            
            <!-- Description, links, [user stories](https://www.agilealliance.org/glossary/user-stories/), etc. What is the problem we are trying to solve? If the work is described/tracked elsewhere, feel free to simply link there. Use the [INVEST](https://www.agilealliance.org/glossary/invest) method to assess completeness. -->
            
            ## Implementation Steps
            
            <!-- This is the "how": the steps to get the acceptance criteria fulfilled. They can be filled in and adjusted after the issue is created/groomed. -->
            
            - [ ]
            
            ## Acceptance Criteria
            
            <!-- [Definition of Done](https://www.agilealliance.org/glossary/definition-of-done). This should be as objective as possible. -->
            
            - [ ]
        EOT
      + file                = ".github/ISSUE_TEMPLATE/general.md"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "charlie"
      + sha                 = (known after apply)
    }

  # module.repo["ghad"].github_repository_file.issue_templates["general.md"] will be updated in-place
  ~ resource "github_repository_file" "issue_templates" {
      ~ content             = <<-EOT
            ---
            name: General
            about: For general Tech Portfolio work
            title: ""
            labels: "g: initial"
            assignees: ""
            ---
            
            ## Background Information
            
            <!-- Description, links, [user stories](https://www.agilealliance.org/glossary/user-stories/), etc. What is the problem we are trying to solve? If the work is described/tracked elsewhere, feel free to simply link there. Use the [INVEST](https://www.agilealliance.org/glossary/invest) method to assess completeness. -->
            
            ## Implementation Steps
            
            <!-- This is the "how": the steps to get the acceptance criteria fulfilled. They can be filled in and adjusted after the issue is created/groomed. -->
            
            - [ ]
            
            ## Acceptance Criteria
            
          - <!-- Definition of Done. ](https://www.agilealliance.org/glossary/definition-of-done) Should be as objective as possible. -->
          + <!-- [Definition of Done](https://www.agilealliance.org/glossary/definition-of-done). This should be as objective as possible. -->
            
            - [ ]
        EOT
        id                  = "ghad/.github/ISSUE_TEMPLATE/general.md"
        # (9 unchanged attributes hidden)
    }

  # module.repo["glossary"].github_repository_file.issue_templates["general.md"] will be created
  + resource "github_repository_file" "issue_templates" {
      + branch              = "master"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = <<-EOT
            updated from canonical source
            
            https://github.com/18F/tts-tech-portfolio/blob/main/.github/ISSUE_TEMPLATE/general.md
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ---
            name: General
            about: For general Tech Portfolio work
            title: ""
            labels: "g: initial"
            assignees: ""
            ---
            
            ## Background Information
            
            <!-- Description, links, [user stories](https://www.agilealliance.org/glossary/user-stories/), etc. What is the problem we are trying to solve? If the work is described/tracked elsewhere, feel free to simply link there. Use the [INVEST](https://www.agilealliance.org/glossary/invest) method to assess completeness. -->
            
            ## Implementation Steps
            
            <!-- This is the "how": the steps to get the acceptance criteria fulfilled. They can be filled in and adjusted after the issue is created/groomed. -->
            
            - [ ]
            
            ## Acceptance Criteria
            
            <!-- [Definition of Done](https://www.agilealliance.org/glossary/definition-of-done). This should be as objective as possible. -->
            
            - [ ]
        EOT
      + file                = ".github/ISSUE_TEMPLATE/general.md"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "glossary"
      + sha                 = (known after apply)
    }

  # module.repo["newrelic-terraform"].github_repository_file.issue_templates["general.md"] will be updated in-place
  ~ resource "github_repository_file" "issue_templates" {
      ~ content             = <<-EOT
            ---
            name: General
            about: For general Tech Portfolio work
            title: ""
            labels: "g: initial"
            assignees: ""
            ---
            
            ## Background Information
            
            <!-- Description, links, [user stories](https://www.agilealliance.org/glossary/user-stories/), etc. What is the problem we are trying to solve? If the work is described/tracked elsewhere, feel free to simply link there. Use the [INVEST](https://www.agilealliance.org/glossary/invest) method to assess completeness. -->
            
            ## Implementation Steps
            
            <!-- This is the "how": the steps to get the acceptance criteria fulfilled. They can be filled in and adjusted after the issue is created/groomed. -->
            
            - [ ]
            
            ## Acceptance Criteria
            
          - <!-- Definition of Done. ](https://www.agilealliance.org/glossary/definition-of-done) Should be as objective as possible. -->
          + <!-- [Definition of Done](https://www.agilealliance.org/glossary/definition-of-done). This should be as objective as possible. -->
            
            - [ ]
        EOT
        id                  = "newrelic-terraform/.github/ISSUE_TEMPLATE/general.md"
        # (9 unchanged attributes hidden)
    }

  # module.repo["pages-redirects"].github_repository_file.issue_templates["general.md"] will be updated in-place
  ~ resource "github_repository_file" "issue_templates" {
      ~ content             = <<-EOT
            ---
            name: General
            about: For general Tech Portfolio work
            title: ""
            labels: "g: initial"
            assignees: ""
            ---
            
            ## Background Information
            
            <!-- Description, links, [user stories](https://www.agilealliance.org/glossary/user-stories/), etc. What is the problem we are trying to solve? If the work is described/tracked elsewhere, feel free to simply link there. Use the [INVEST](https://www.agilealliance.org/glossary/invest) method to assess completeness. -->
            
            ## Implementation Steps
            
            <!-- This is the "how": the steps to get the acceptance criteria fulfilled. They can be filled in and adjusted after the issue is created/groomed. -->
            
            - [ ]
            
            ## Acceptance Criteria
            
          - <!-- Definition of Done. ](https://www.agilealliance.org/glossary/definition-of-done) Should be as objective as possible. -->
          + <!-- [Definition of Done](https://www.agilealliance.org/glossary/definition-of-done). This should be as objective as possible. -->
            
            - [ ]
        EOT
        id                  = "pages-redirects/.github/ISSUE_TEMPLATE/general.md"
        # (9 unchanged attributes hidden)
    }

  # module.repo["private-eye"].github_repository_file.issue_templates["general.md"] will be updated in-place
  ~ resource "github_repository_file" "issue_templates" {
      ~ content             = <<-EOT
            ---
            name: General
            about: For general Tech Portfolio work
            title: ""
            labels: "g: initial"
            assignees: ""
            ---
            
            ## Background Information
            
            <!-- Description, links, [user stories](https://www.agilealliance.org/glossary/user-stories/), etc. What is the problem we are trying to solve? If the work is described/tracked elsewhere, feel free to simply link there. Use the [INVEST](https://www.agilealliance.org/glossary/invest) method to assess completeness. -->
            
            ## Implementation Steps
            
            <!-- This is the "how": the steps to get the acceptance criteria fulfilled. They can be filled in and adjusted after the issue is created/groomed. -->
            
            - [ ]
            
            ## Acceptance Criteria
            
          - <!-- Definition of Done. ](https://www.agilealliance.org/glossary/definition-of-done) Should be as objective as possible. -->
          + <!-- [Definition of Done](https://www.agilealliance.org/glossary/definition-of-done). This should be as objective as possible. -->
            
            - [ ]
        EOT
        id                  = "private-eye/.github/ISSUE_TEMPLATE/general.md"
        # (9 unchanged attributes hidden)
    }

  # module.repo["uswds-jekyll"].github_repository_file.issue_templates["general.md"] will be updated in-place
  ~ resource "github_repository_file" "issue_templates" {
      ~ content             = <<-EOT
            ---
            name: General
            about: For general Tech Portfolio work
            title: ""
            labels: "g: initial"
            assignees: ""
            ---
            
            ## Background Information
            
            <!-- Description, links, [user stories](https://www.agilealliance.org/glossary/user-stories/), etc. What is the problem we are trying to solve? If the work is described/tracked elsewhere, feel free to simply link there. Use the [INVEST](https://www.agilealliance.org/glossary/invest) method to assess completeness. -->
            
            ## Implementation Steps
            
            <!-- This is the "how": the steps to get the acceptance criteria fulfilled. They can be filled in and adjusted after the issue is created/groomed. -->
            
            - [ ]
            
            ## Acceptance Criteria
            
          - <!-- Definition of Done. ](https://www.agilealliance.org/glossary/definition-of-done) Should be as objective as possible. -->
          + <!-- [Definition of Done](https://www.agilealliance.org/glossary/definition-of-done). This should be as objective as possible. -->
            
            - [ ]
        EOT
        id                  = "uswds-jekyll/.github/ISSUE_TEMPLATE/general.md"
        # (9 unchanged attributes hidden)
    }

  # module.usagov.github_membership.owner["lrussell01"] will be created
  + resource "github_membership" "owner" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "lrussell01"
    }

  # module.uswds.github_membership.owner["lrussell01"] will be created
  + resource "github_membership" "owner" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "lrussell01"
    }

Plan: 27 to add, 6 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [plan #205](https://github.com/18F/tts-tech-portfolio/actions/runs/3115641182)